//จะเรียงเฉพาะตัวที่เลือก.. มั้ง? ไม่รู้ ไม่เข้าใจ ไม่รู้เรื่อง เหนื่อย ท้อ ไม่อยากตื่นมาแล้ว

//ทางทฤษฎีมันควรจะเอาข้อมูลใน Array ตัวแรก แล้วสลับที่กับตัวที่ค่าน้อยที่สุด
//แต่ไม่รู้โว้ยยยยยยย...

//เช่น
//{64, 25, 12, 22, 11}

//เริ่มที่ตัวแรกคือ 64 มันก็จะไล่หาตัวที่น้อยที่สุด ก็คือ 11 แล้วสลับที่
//{11, 25, 12, 22, 64}

//ตัวต่อมาคือ 25 สลับกับ 12
//{11, 12, 25, 22, 64}

//และก็ 25 กับ 22
//{11, 12, 22, 25, 64}

//คิดว่านะ
#include <stdio.h>

void SelectionSort(int N, int Data[]) {
    int i, j, Min, Temp;
    for(i = 0; i <= N-1; i++) {
        Min = i;
        for(j = i+1; j < N; j++) {
            if(Data[j] < Data[Min]) {
                Min = j;
            }
            Temp = Data[i];
            Data[i] = Data[Min];
            Data[Min] = Temp;
        }
    }
}

void main() {
    int Data[5] = {64, 25, 12, 22, 11}, i;

    printf("Array ที่ยังไม่เรียง\n");
    for(i = 0; i <= 4; i++) {
        printf("%d ", Data[i]);
    }
    printf("\n");
    //            v คือถ้าค่าตรงนี้ตรงกับจำนวนข้อมูลของ Array ดูเหมือนจะทำงานปกติ
    //            v แต่พอมันไม่ตรง ผลออกมามันจะแปลก ๆ
    //            v แล้วจะมีให้ใส่เพื่ออออออออออ
    SelectionSort(5, Data);

    printf("Array ที่เรียงแล้ว\n");
    for(i = 0; i <= 4; i++) {
        printf("%d ", Data[i]);
    }
}